Revit 2024 API
DirectShapeLibrary.Contains Method
 A quick check whether a definition already exists in the library. Checks for stored geometry objects only.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool Contains(
	string id
)
Visual Basic
Public Function Contains ( _
	id As String _
) As Boolean
Visual C++
public:
bool Contains(
	String^ id
)
Parameters
id
Type: System.String
 Definition id
Return Value
 True if a geometry definition exists, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace